recommendations = [
    {
        "input": "شنو هما الأماكن اللي خاص عشاق التاريخ يزوروها فمراكش؟",
        "output": "عشاق التاريخ فمراكش خاصهم يزورو القبور السعدية باش يعرفو على التاريخ الملكي، قصر الباهية بسبب الهندسة المعمارية المعقدة، ومسجد الكتبية اللي هو أكبر مسجد فمراكش."
    },
    {
        "input": "كنخطط نزور كازا فشهر ماي. شنو هي الأنشطة الفريدة اللي خاصني نحاول نجربها؟",
        "output": "فشهر ماي، تقدر تتمشى على طول كورنيش عين دياب، تزور المغرب مول باش تشوف الأكواريوم المميز والتسوق الفاخر، وتتعشا فريك كافيه اللي مستوحى من الفيلم كازابلانكا."
    },
    {
        "input": "شنو هما أحسن البلايص ففاس باش تعيش تجربة ثقافية؟",
        "output": "ففاس، خاصك تزور مدرسة العطارين حيت عندها زليج معقد، تشوف المدابغ وتتعلم على الصنعة التقليدية، وتتجول فالسوق الكبير ديال المدينة القديمة اللي هي موقع ديال اليونسكو."
    },
    {
        "input": "شنو هي الأنشطة اللي كتوفرها الصويرة لعشاق المغامرة؟",
        "output": "عشاق المغامرة فالصويرة يقدرو يجربو ركوب الأمواج بالرياح، يركبو الخيل على الشاطئ، ويكتشفو الكثبان الرملية بدراجات الرباعية."
    },
    {
        "input": "شنو هي الأنشطة المميزة فرباط للأطفال؟",
        "output": "فرباط مع الأطفال، تقدر تزور حديقة الحيوانات باش تشوف الحيوانات الغريبة، تدير نزهة فمارينا بورقراق، وتكتشف المتحف العلمي للأطفال اللي عندو عروض تفاعلية."
    },
    {
        "input": "شنو هي أفضل الأنشطة فطنجة فشهر سبتمبر؟",
        "output": "فسبتمبر، زور منارة كاب سبارطيل باش تشوف مناظر ساحلية رائعة، اكتشف مغارات هرقل، وتمشى فقصبة طنجة باش تستمتع بالثقافة المحلية."
    },
    {
        "input": "شنو هما الأماكن اللي خارج المسار السياحي فشفشاون؟",
        "output": "فشفشاون، سير لجبل أقشور باش تستمتع بالطبيعة، زور راس الماء باش تشوف المناظر، وتجول فالأزقة الزرقاء البعيدة على الساحة الرئيسية باش تكون تجربة هادئة."
    },
    {
        "input": "بغيت نزور أكادير. شنو هي الأنشطة المميزة ديال العناية بالذات؟",
        "output": "فاكادير، استمتع بتجربة الحمام المغربي التقليدي، خد دروس اليوغا على الشاطئ، وزور كروكو بارك باش تدوز نهار وسط الحدائق والتماسيح."
    },
    {
        "input": "شنو هي أحسن التجارب ديال الماكلة اللي خاصني نجربها فمراكش؟",
        "output": "فمراكش، تغدا فشي مطعم على السطح فالمدينة القديمة وجرب الطاجين، زور دار يعقوت باش تعيش وجبة مغربية راقية، وجرب المأكولات فجامع الفنا بحال المسمن والحريرة."
    },
    {
        "input": "شنو هي الأماكن اللي خاصك تزورها فمكناس فنهار واحد؟",
        "output": "فنهار واحد فمكناس، زور باب المنصور، ضريح مولاي إسماعيل، والأطلال الرومانية ديال وليلي اللي قريبة من المدينة."
    },
    {
        "input": "شنو هي أفضل بلايص باش تشوف النجوم فمرزوكة؟",
        "output": "فمرزوكة، خاصك تحجز ليلة فمخيم أمازيغي فالصحرا، تطلع فوق كثبان عرق الشبي باش تشوف منظر واضح، وتتمتع بمشاهدة النجوم خلال جولة بالجمال."
    },
    {
        "input": "شنو هي أجمل البلايص اللي كتعطي مناظر فداخلة؟",
        "output": "فداخلة، زور جزيرة التنين باش تستمتع بالمناظر، اكتشف الكثيب الأبيض اللي كيجمع بين الصحرا والبحر، وتمتع بالمناظر ديال اللاجون وأنت كتمارس الكايت سورف."
    },
    {
        "input": "شنو خاصني نزور فوارزازات إذا عندي غير نهار واحد؟",
        "output": "فنهار واحد، زور قصبة آيت بن حدو باش تشوف المناظر التاريخية، دير جولة فستوديوهات الأطلس السينمائية، وشوف قصبة تاوريرت اللي وسط المدينة."
    },
    {
        "input": "شنو هي الأماكن اللي خاصك تزورها باش تدير رياضة المشي فإفران؟",
        "output": "حدا إفران، تمشى فغابة الأرز باش تشوف القردة، اكتشف المسارات ديال ميشليفن، وزور بحيرة ضاية عوا باش تشوف مناظر زوينة ومسارات هادئة."
    },
    {
        "input": "شنو هي الأماكن اللي خاص عشاق الفن يكتشفوها فتيطوان؟",
        "output": "عشاق الفن خاصهم يزورو المعهد الوطني للفنون الجميلة، يكتشفو ورشات الحرفيين فالمدينة القديمة، ويشوفو المتحف الأركيولوجي باش يتعرفو على الثقافة المحلية."
    },
    {
        "input": "شنو هي أفضل الأنشطة فوجدة فالربيع؟",
        "output": "فالربيع، تمتع بالزهور اللي كيزهرو فحديقة للا عيشة، زور المسجد الكبير باش تعيش تجربة روحانية، واستكشف واحة سيدي يحيى اللي كتوفر راحة وهدوء."
    },
    {
        "input": "شنو هي التجارب الفريدة اللي كيمكن تصورها فمدينة أصيلة؟",
        "output": "المصورين غادي يعجبهم يصورو الجداريات الملونة فمدينة أصيلة، يشوفو مناظر غروب الشمس من الأسوار، ويكتشفو الجمال الطبيعي ديال شاطئ الجنة."
    }
]
